Revit 2027 API
ParameterTypeId.RbsPipeFluidTypeParam Property
 "Fluid Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeFluidTypeParam { get; }
Public Shared ReadOnly Property RbsPipeFluidTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeFluidTypeParam {
	ForgeTypeId^ get ();
}
static member RbsPipeFluidTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace